analyr/lectureadv/psm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-11 四 12:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>倾向得分匹配</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="厦门大学公共事务学院" />
</head>
<body>
<div id="content">
<h1 class="title">倾向得分匹配</h1>

<div id="outline-container-org149bca4" class="outline-2">
<h2 id="org149bca4"><span class="section-number-2">1</span> 因果推断</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge5afab0" class="outline-3">
<h3 id="orge5afab0"><span class="section-number-3">1.1</span> 实验法和准实验法</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>反事实模型: 要理解因果就需要先理解反事实模型，如果我们考量辍学对小明的成年后收入的影响，严格而言我们要想象存在两个平行世界，在一个世界中小明辍学，在另一个世界中小明没有辍学，其他条件完全相同，然后我们比较两个世界中小明成年工作后的收入，才是真正的因果效应。显然我们“无法同时踏进两条河流”，所谓我们理论上无法观察到真正的因果效应。@Holland1986 称之为因果推断的基本问题。</li>
<li>平均效应：如果我们考虑某个中学的学生，希望比较辍学对学生成年后收入的影响。对于任意一个学生，他的收入有两种潜在结果。\(D_i\)为第i个学生是否辍学。</li>
</ul>
\begin{equation*}
Y_i = 
\begin{cases}
   Y_{1i} & D_i =1 \\
   Y_{0i} & D_i =0
\end{cases}
\end{equation*}
<p>
那么对于所有学生，平均意义上的因果效应（average casual effect）为：
\[E[Y_i | D_i =1]-E[Y_i | D_i =0] = \underbrace{E[Y_{1i} | D_i =1]-E[Y_{0i} | D_i =1]}_{\text{处理的平均因果效应}} +\underbrace{E[Y_{0i} | D_i =1] - E[Y_{0i} | D_i =0]}_{\text{选择性偏误}} \]
</p>

<ul class="org-ul">
<li>实验法是一种探索因果关系的观察方法。 
<ul class="org-ul">
<li>自变量和因变量：考察自变量对因变量的影响。</li>
<li>前测与后测：因变量前后测之间的差异视为自变量的影响。</li>
<li>实验组与控制组：控制组用来消除实验本身的影响。</li>
<li>选择受试者：概率抽样和随机化分配，以使实验组与控制组可比。\[E[Y_{0i} | D_i =1] - E[Y_{0i} | D_i =0]=0\]</li>
</ul></li>

<li>自然实验法/准实验法：自然（社会政治决策者）设计并实施的实验，发生在受控情境之外，即对控制组或者所研究的因素几乎无法施加控制。与一般随机实验的区别是无法将个体随机分配，因此观察得到的结果可能和个体的某些不可观察因素有关。</li>

<li>针对自然实验或准实验，假设理想条件下的实验，找到合适、可比较的控制组，来对事实与反事实进行比较。
<ul class="org-ul">
<li>倾向得分匹配（PSM）</li>
<li>倍差法（DID）</li>
<li>工具变量法（IV）</li>
<li>断点回归设计（RDD）</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf689372" class="outline-3">
<h3 id="orgf689372"><span class="section-number-3">1.2</span> 倾向得分匹配（propensity score matching）</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>因果推断的目的是了解在有无干预的两种条件下，可观察结果之间的差异。但是不可能同时观察到同一个体在有无干预两种条件下的结果。直接采用未进入处理组的个体的平均值代替无干预条件下的结果进行比较会带来选择偏误（selection bias）。比如，积极性高的学生参加就业指导培训的可能性比较高，积极性高的学生找到工作的可能性也高。</li>

<li>倾向得分匹配（PSM）可以用来解决选择偏误问题，它是一种非精确匹配方法，在一组未进入处理组的个体中找到与处理组特征相似的个体。</li>

<li>倾向得分是给定可观测特征条件下，个体进入处理组的概率： \(S(X_i)=Pr(P=1|X_i)\)</li>

<li>倾向得分匹配的步骤：  
<ol class="org-ol">
<li>决定使用倾向得分匹配还是协变量匹配</li>
<li>倾向得分估计</li>
<li>选择匹配算法</li>
<li>检查重叠/共同支撑</li>
<li>匹配效果估计</li>
<li>敏感性分析</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org636ff5c" class="outline-3">
<h3 id="org636ff5c"><span class="section-number-3">1.3</span> 评估框架与匹配原理</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>处理效应与选择偏误：  
<ul class="org-ul">
<li>Roy-Rubin 因果模型： \(\tau_i=Y_{1i}-Y_{0i}\)</li>
<li>总体平均因果效应： \(ATE = E(\tau)=E[Y_1-Y_0]\) ，如果总体中个体被随机分配到处理组，结果的预期效应是什么？（可能不适用，例如扶贫项目）</li>
<li>处理的平均因果效应： \(ATT=E(\tau|D=1)=E[Y_1|D=1]-E[Y_0|D=1]\)</li>
<li>如果采用未进入处理组的平均值 \(E[Y_0|D=0]\) 来替代无法观测反事实均值 \(E[Y_0|D=1]\) ，则会出现选择偏误：</li>
</ul></li>
</ul>

<p>
\[E[Y_1|D=1]-E[Y_0|D=0]=ATT+E[Y_0|D=1]-E[Y_0|D=0]\]
</p>

<ul class="org-ul">
<li>条件独立假定（CIA）和共同支撑（common support）
<ul class="org-ul">
<li>条件独立假定： \(Y(0),Y(1)\perp\!\!\!\perp D|X\). 所有同时影响进入处理组和结果的变量必须可观测，否则采用其他方法（IV, DID）。</li>
<li>共同支撑/重叠： \(0<P(D=1|X)<1\) . 具有相同特征的个体是否进入处理组的概率为正。</li>
<li>倾向得分条件独立： \(Y(0),Y(1)\perp\!\!\!\perp D|P(X)\)</li>
<li>PSM估计值是共同支撑上，由处理组倾向得分分布加权平均的结果差值。</li>
</ul></li>
</ul>

<p>
\[\tau_{ATT}^{PSM}=E_{P(X)|D=1}\{E[Y(1)|D=1,P(X)]-E[Y(0)|D=0,P(X)]\}\]
</p>
</div>
</div>

<div id="outline-container-org5e8351a" class="outline-3">
<h3 id="org5e8351a"><span class="section-number-3">1.4</span> 倾向得分匹配的实施</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>倾向得分估计  
<ul class="org-ul">
<li>模型选择：二值处理（logit/probit）、多值处理（多项回归等）</li>
<li>变量选择：无遗漏、不被处理所改变、无完全分离变量、有理论和实证基础</li>
</ul></li>
<li>选择匹配算法  
<ul class="org-ul">
<li>最近邻匹配：匹配倾向得分最接近的处理组个体与非处理组个体</li>
<li>近值匹配和半径匹配（Caliper and radius matching）：设置倾向得分范围，再匹配最近邻或近值半径内所有个体</li>
<li>分层匹配和区间匹配（strafication and interval matching）：将倾向得分的共同支撑划分成区间（一般5个）然后进行效应估计。</li>
<li>核匹配和局部线性匹配（kernal and local linear matching）：利用核密度函数计算控制组中所有个体的加权平均构建反事实结果。</li>
</ul></li>
<li>重叠与共同支撑  
<ul class="org-ul">
<li>最大最小值比较：剔除倾向得分大于对照组最大值和小于最小值的个体。</li>
<li>修剪法：为了避免对照组中部密度过低发生错配，可以采用倾向得分密度阈值修剪以获得可靠的共同支撑。</li>
</ul></li>
<li>评价匹配效果
<ul class="org-ul">
<li>标准化偏误（小于3-5%）</li>
<li>协变量均值 t 检验</li>
<li>联合显著与伪R方</li>
<li>分层检验</li>
</ul></li>
<li>敏感性分析
<ul class="org-ul">
<li>偏离条件独立：存在未观测的变量同时影响处理变量和结果变量，可通过假定未观测变量分布或生成多个控制组来检验处理效应的稳健性</li>
<li>共同支撑剔除观测：利用共同支撑剔除的观测估计处理效应的非参数边界，检验稳健性</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org6836eb4" class="outline-3">
<h3 id="org6836eb4"><span class="section-number-3">1.5</span> 倾向得分匹配操作与示例</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>美国国家支持工作示范（NSW）项目采用随机试验的方式检验了就业培训项目对弱势工人群体的作用。参与者是随机选入能否参加培训项目，通过处理组与控制组比较得出工资的均值差异是800美元。</li>
<li>Lalonde（1986）希望采用调查数据检验是否非实验数据也能得出相似结果，他发现的工资效应范围是700到16000美元，差别很大。</li>
<li>Deheija和Wahba（1996）认为Lalonba的处理组与控制组的数据非常地不平衡，他们采用倾向得分匹配重新对当前人口调查CPS数据进行了分析，得出与试验相近的结论。</li>

<li>美国就业培训项目评价：614个观测（处理组185；控制组429）、10个变量  
<ul class="org-ul">
<li>"treat" (1=处理组,0=控制组)</li>
<li>"age"是年龄，"educ"是教育程度（年）</li>
<li>"black"是否为黑人(1=是, 0=否)，"hispan"是否为西班牙语裔(1=是, 0=否)</li>
<li>"married"(1=是, 0=否)，"nodegree"是否具有高中学历(1=无, 0=有)</li>
<li>"re74", "re75", "re78"分别为1974、1975、1978年的收入.</li>
</ul></li>

<li>初步分析：  
<ul class="org-ul">
<li>比较处理组与控制组的协变量是否平衡：MatchBalance()</li>
<li>探索性直接回归模型的结果</li>
</ul></li>
<li>倾向得分估计：  
<ul class="org-ul">
<li>手动估计是为了更好的设定匹配模型，选取显著的变量和理论上的影响变量</li>
<li>可以直接获取倾向得分，检验匹配前的倾向得分平衡性</li>
</ul></li>
<li>倾向得分匹配：matchit()，并检验平衡性</li>
<li>结果分析：可采用线性回归、方差分析、独立或成对样本t检验等</li>
<li>敏感性分析：  
<ul class="org-ul">
<li>采用假定gamma值代表未观察变量对结果的影响，检验显著性的变化；</li>
<li>显著性出现变化时对应gamma值越大，则匹配结果对未观测变量不敏感。</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 厦门大学公共事务学院</p>
<p class="date">Created: 2019-07-11 四 12:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
